#Единицы массы пронумерованы следующим образом: 1 — килограмм, 2 — миллиграмм, 3 — грамм, 4 — тонна, 5 — центнер.
#Дан номер единицы массы и масса тела M в этих единицах (вещественное число). Вывести массу данного тела в килограммах.
# Данную задачу нужно решить с помощью конструкции  match  (Python v3.10)


# Пример:
# Введите единицу массы тела
#       1 - килограмм
#       2 — миллиграмм
#       3 — грамм
#       4 — тонна
#       5 — центнер
#>4

#Введите  массу тела
#>1

#Ответ: 1000 кг

m = int(input())
x = int(input())
def operation(m, code):
    match code:
        case 1:
            return m * 1
        case 2:
            return m / 1000000
        case 3:
            return m / 100
        case 4:
            return m * 1000
        case 5:
            return m * 100
print(operation(x, m))